espressif/esp-self-reflasher/examples/ota_reflash/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF)  Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_EXAMPLE_BOOTLOADER_DEST_ADDRESS=0x0000
CONFIG_EXAMPLE_SKIP_COMMON_NAME_CHECK=y
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y
CONFIG_SPI_FLASH_DANGEROUS_WRITE_ALLOWED=y
